// 1. Вам дана переменная num, присвойте ей значение. Выведите значение этой переменной в консоль.
// let num = [100]
// console.log((num));
// 2. Вам даны переменные a=10, b=2 и c=5. Выведите в консоль их сумму.
// let arr = a = 10
// b = 2
// c = 5
// console.log(a + b + c);

// 3. Вам дана переменная со значением 100, выведите в консоль умноженную переменную на 2.
// let arr = 100
// console.log(100 * 2);
// 4. Вам дана переменная со значением 67. Выведите в консоль остаток деления на 7.
// let arr = 67
// console.log(arr / 7);
// 5. Вам даны переменные a=10 и b=2. Выведите в консоль их сумму, разность, произведение и частное (результат деления).
// let arr =  a=10, b=2
// console.log(a = b);
// console.log(a - b);
// console.log(a * b);
// console.log(a / b);
// 6. Вам даны переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной result. Выведите в консоль значение переменной result.
// let arr = c=15
// d=2
// result = 17
// console.log(result);
// 7. Вам даны переменные a=30, и b=15 Сложите переменные a и b и результат присвойте переменной c.
// Затем выведите в консоль остаток деления на 4 переменной c.
// let a = 30, b = 15
//   c = a * b
//   console.log(c % 4);

// //ременные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c.
//8. Затем создайте переменную d, присвойте ей значение. Сложите переменные c и d, а результат запишите в переменную result.
//Выведите в консоль значение переменной result.
// let arr =  a=17, b=10
// c = a - b
// result = c * d
// console.log(result);
// Округление вниз:
// Напишите функцию, которая принимает число и округляет его вниз до ближайшего меньшего целого.
// let a = 7.9
// console.log(Math.floor(7.9));
// // Округление вверх:
// Напишите функцию, которая принимает число и округляет его вверх до ближайшего большего целого.
//let a = 5.2
// console.log(Math.cail());
// Округление числа:
// Напишите функцию, которая принимает число и округляет его до ближайшего целого.
// let a = 9.5
// console.log(Math.trunc(9.5));
// Генерация случайного числа в диапазоне с округлением:
// Напишите функцию, которая принимает два числа - минимальное и максимальное значение - и возвращает случайное целое число в указанном диапазоне.
// let a = 100
// console.log(Math.random(100) * 100);

// let a = 10;
// let b = "10";

// if (a = b) {
//   console.log(true);
// } else {
//   console.log(false);
// }

// 1. Вам дана переменная str, присвойте ей значение 'Привет, Мир!'. Выведите значение этой переменной в консоль.

// let str =  'Привет, Мир!'
// console.log(str);

// 2. Вам даны переменные str1='Привет, ' и str2='Мир!'. С помощью этих переменных и операции сложения строк выведите в консоль фразу 'Привет, Мир!'.

// 3. Вам дана переменная name, присвойте ей ваше имя. Выведите в консоль фразу 'Привет, *Имя*!'.

// 4. Вам дана переменная age , присвойте ей ваш возраст. Выведите в консоль 'Мне *Возраст* лет!'.

// 5. Вам даны четыре переменные.
// Первая - для хранения количества дней. Присвойте ей значение "365".
// Вторая - для хранения названия нашей планеты "Земля".
// Третья - для хранения примерного количества жителей нашей планеты. Присвойте ей значение "7 млрд.".
// Четвертая - для хранения слова "Солнце".
// Далее, используя текст и переменные, нужно вывести в консоль такой абзац:
// "В нашем году 365 дней. Днём у нас светит Солнце. Население планеты Земля составляет примерно 7 млрд. человек."

// let dey = "365";
// let earth = "Земля";
// let man = "7 млрд.";
// let son = "Солнце";
